# RbsPipeDiameterParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsPipeDiameterParam Property
ParameterTypeId Class See Also
---
"Diameter"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsPipeDiameterParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsPipeDiameterParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsPipeDiameterParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace